{
  "Fronted Developer": "مطور مواقع",
  "Hello , I'm": "أهلا، أنا",
  "Ahmed Barkhed": "أحمد برخد",
  "Download CV": "تحميل سيرة الذاتية",
  "Contact Info": "أعرف المزيد",
  "Portfolio": "ملفي الشخصي",
  "Home": "الرئيسية",
  "Services": "خدماتي",
  "Experience": "خبراتي",
  "Projects": "المشاريع",
  "Contact": "الاتصال",
  "Browser My Recent": "تصفح آخر",
  "Prayer times project": "مشروع مواقيت الصلاة",
  "A responsive web application that calculates and displays the next prayer time and the remaining time until the next prayer. Designed for seamless use across all devices.": "تطبيق ويب سريع الاستجابة يقوم بحساب وعرض وقت الصلاة التالية والوقت المتبقي حتى الصلاة التالية. مصمم للاستخدام السلس عبر جميع الأجهزة.",
  "Social Media Project": "مشروع التواصل الاجتماعي",
  "A platform to connect users, share updates, and interact with content. Features include user profiles, news feeds, and more.": "منصة لتوصيل المستخدمين ومشاركة التحديثات والتفاعل مع المحتوى. تتضمن الميزات ملفات تعريف المستخدمين وموجزات الأخبار والمزيد.",
  "Football Academy Project": "مشروع أكاديمية كرة القدم",
  "An online platform dedicated to football academies, offering official sponsorships and various payment methods. It includes discounts and promotions for sponsors, providing a streamlined experience for managing academy funding.": "منصة إلكترونية مخصصة لأكاديميات كرة القدم، تقدم الرعاية الرسمية وطرق الدفع المختلفة. وتتضمن خصومات وعروض ترويجية للرعاة، مما يوفر تجربة مبسطة لإدارة تمويل الأكاديمية.",
  "Weather Application Project": "مشروع تطبيقات الطقس",
  "A weather application that provides real-time weather updates and forecasts. It supports both English and Arabic languages, allowing users to easily switch between languages for localized weather information.": "تطبيق طقس يوفر تحديثات وتنبؤات جوية في الوقت الفعلي. وهو يدعم اللغتين الإنجليزية والعربية، مما يتيح للمستخدمين التبديل بسهولة بين اللغات للحصول على معلومات الطقس المحلية.",
  "Todo List Project": "مشروع قائمة المهام",
  "A task management application featuring lists for both completed and pending tasks. Users can organize their tasks, mark them as completed, and easily track their progress.": "تطبيق لإدارة المهام يضم قوائم لكل من المهام المكتملة والمعلقة. يمكن للمستخدمين تنظيم مهامهم ووضع علامة عليها كمكتملة وتتبع تقدمها بسهولة.",
  "My Notes Project": "مشروع ملاحظاتي",
  "An application for managing notes with a feature to recover deleted tasks and a mobile-friendly interface for users. It includes a task list where users can organize and manage their notes efficiently.": "تطبيق لإدارة الملاحظات مع ميزة استعادة المهام المحذوفة وواجهة سهلة الاستخدام للهواتف المحمولة للمستخدمين. ويتضمن قائمة مهام حيث يمكن للمستخدمين تنظيم ملاحظاتهم وإدارتها بكفاءة.",
  "Technologies Used": "التقنيات المستخدمة",
  "Get In Touch": "ابقى على تواصل",
  "Contact Me": "اتصل بي",
  "Explore my": "أستكشف",
  "Front-End":"مطور واجهات أمامية",
  "Browse our diverse services offered to clients, including creative design, web development, and technology consulting.":"تصفح خدماتنا المتنوعة المقدمة للعملاء، بما في ذلك التصميم الإبداعي، وتطوير الويب، والاستشارات التكنولوجية",
  "Performance Optimization":"تحسين الأداء",
  "Optimizing website performance to ensure fast loading times and a better user experience.":"تحسين أداء المواقع لضمان تحميل سريع وتجربة مستخدم أفضل.",
  "UI/UX Design":"التصميم الجرافيكي",
  "Creating intuitive, visually appealing interfaces that prioritize user experience, ensuring that your website or application is not only functional but also enjoyable to use. By focusing on design principles and user feedback, I aim to deliver interfaces that are both aesthetically pleasing and highly efficient.":"إنشاء واجهات بديهية وجذابة بصريًا تركز على تجربة المستخدم، مما يضمن أن يكون موقع الويب أو التطبيق الخاص بك ليس فقط عمليًا بل أيضًا ممتعًا في الاستخدام. من خلال التركيز على مبادئ التصميم وملاحظات المستخدم، أسعى لتقديم واجهات تكون ممتعة وكفوءة في نفس الوقت.",
  "Front-End Development":"تطوير واجهات المستخدم",
  "Developing user interfaces using HTML, CSS, and JavaScript, along with the React framework to create innovative designs and provide a smooth, responsive user experience.":" تطوير واجهات المستخدم باستخدام HTML, CSS, و JavaScript، بالإضافة إلى إطار العمل React لإنشاء تصاميم مبتكرة وتجربة مستخدم سلسة ومتجاوبة.",
  "Responsive Web Design":"تصميم الويب سريع الاستجابة",
  "Designing responsive websites using Bootstrap and Material-UI to ensure an optimal user experience across various devices.":"تصميم مواقع متجاوبة باستخدام Bootstrap و Material-UI لضمان تجربة مستخدم مثالية على مختلف الأجهزة.",
  "Version Control with Git and GitHub":"إدارة التعليمات البرمجية",
  "Managing code using Git and GitHub to ensure effective collaboration and code review.":"إدارة التعليمات البرمجية باستخدام Git و GitHub لضمان التعاون الفعّال ومراجعة التعليمات البرمجية.",
  "API Integration":"تكامل واجهة برمجة التطبيقات",
  "Integrating websites with APIs to display dynamic data and enhance interactivity.":"تكامل مواقع الويب مع واجهات برمجة التطبيقات (APIs) لعرض البيانات الديناميكية وتحسين التفاعل."
}